app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "participations".* FROM "participations" WHERE "participations"."event_id" = $1  [["event_id", 9]]
---
  def show
    @event = Event.find(params[:id])
    @count = Participation.where("\"#{@event.uuid}\" = true")

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def destroy
    @event = Event.find(params[:id])

INSERT INTO "events" ("title", "place", "description", "starttime", "endtime", "eventpass", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @event = Event.new(event_params)
    # @event.uuid = SecureRandom.uuid.gsub("-", "")
    # ActiveRecord::Migration.add_column :participations, "#{@event.uuid}", :boolean, :null => false, :default => false

    if @event.save