app/controllers/participations_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "participations" ("uin", "first_name", "last_name", "email", "created_at", "updated_at", "event_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @event_id = params[:event_id]
    @event = Event.find(params[:event_id]) rescue nil
    puts @event.nil?
    if @event.nil?
      redirect_to new_participation_path, :flash => { message: "No such event associated with id" }
    else
      if @event.eventpass == params[:event_pass]
        @participation = Participation.new(participation_params)
        @participation.save